app/controllers/purchases_controller.rb

SELECT "purchases".* FROM "purchases"
---
  def index
    @purchases = Purchase.all

SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT 1  [["id", "8"]]
---
  def show
    @purchase = Purchase.find(params[:id])

INSERT INTO "inventories" ("created_at", "item_description", "item_price", "merchant_address", "merchant_name", "purchase_count", "purchase_id", "purchaser_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "purchases" ("created_at", "file_name", "gross_revenue", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 23 Apr 2014 15:32:45 UTC +00:00], ["file_name", "example_input.tab"], ["gross_revenue", nil], ["updated_at", Wed, 23 Apr 2014 15:32:45 UTC +00:00]]
---
  def create

    @purchase = Purchase.new(file_name: params[:file].original_filename)

    # Using SmarterCSV in order to map the tab correctly to fields in case they are missing fields

    inventories = SmarterCSV.process(params[:file].path.to_s, {:col_sep => "\t", :row_sep => "\n"})

    @inventory_errors = validate_inventories(inventories)



    if  @inventory_errors.empty?

      revenue = 0.0
      inventories.each{|row|
        @inventory = Inventory.new(row)
        @inventory.purchase = @purchase
        revenue = revenue + (@inventory.item_price * @inventory.purchase_count)

        @inventory.save